<template>
<div>
  <hr>
  <div style='color: black;'>
    <p>{{ author1 }} lived in {{ name }}</p>
    <p style='white-space: pre-line; text-align: left;'>在苍茫的大海上，狂风卷集着乌云。在乌云和大海之间，海燕像黑色的闪电，在高傲地飞翔。

一会儿翅膀碰着波浪，一会儿箭一般地直冲向乌云，它叫喊着，──就在这鸟儿勇敢的叫喊声里，乌云听出了欢乐。

在这叫喊声里──充满着对暴风雨的渴望！在这叫喊声里，乌云听出了愤怒的力量、热情的火焰和胜利的信心。

海鸥在暴风雨来临之前呻吟着，──呻吟着，它们在大海上飞窜，想把自己对暴风雨的恐惧，掩藏到大海深处。

海鸭也在呻吟着，──它们这些海鸭啊，享受不了生活的战斗的欢乐：轰隆隆的雷声就把它们吓坏了。

蠢笨的企鹅，胆怯地把肥胖的身体躲藏到悬崖底下……只有那高傲的海燕，勇敢地，自由自在地，在泛起白沫的大海上飞翔！

乌云越来越暗，越来越低，向海面直压下来，而波浪一边歌唱，一边冲向高空，去迎接那雷声。

雷声轰响。波浪在愤怒的飞沫中呼叫，跟狂风争鸣。看吧，狂风紧紧抱起一层层巨浪，恶狠狠地把它们甩到悬崖上，把这些大块的翡翠摔成尘雾和碎末。

海燕叫喊着，飞翔着，像黑色的闪电，箭一般地穿过乌云，翅膀掠起波浪的飞沫。

看吧，它飞舞着，像个精灵，──高傲的、黑色的暴风雨的精灵，——它在大笑，它又在号叫……它笑那些乌云，它因为欢乐而号叫！

这个敏感的精灵，——它从雷声的震怒里，早就听出了困乏，它深信，乌云遮不住太阳，──是的，遮不住的！</p>
  </div>
  <hr>
  <div style='color: black;'>
    <p>{{ author2 }} lived in {{ name }}</p>
    <p style='white-space: pre-line; text-align: left;'>
            真的猛士，敢于直面惨淡的人生，敢于正视淋漓的鲜血。
            伟大的成绩和辛勤劳动是成正比例的，有一分劳动就有一分收获，日积月累，从少到多，奇迹就可以创造出来。
            时间，就象海棉里的水，只要愿挤，总还是有的。
            教育植根于爱。
            时间对于我来说是很宝贵的，用经济学的眼光看是一种财富。
            战士的日常生活，是并不全部可歌可泣的，然而又无不和可歌可泣相关联，这才是实际上的战士。
            哪里有天才，我是把别人喝咖啡的工夫都用在了工作上了。
            节省时间；也就是使一个人的有限生命，更加有效而也即等于延长了人的生命。
    </p>
  </div>
  <hr>
  <div style='color: red;'>
    <p>{{ author3 }} lived in {{ name }}</p>
    <p>人生最宝贵的是生命，生命每个人只有一次。人的一生应当是这样度过的，当回首往事的时候，他不会因为虚度年华而悔恨，也不会因为碌碌无为而羞耻，在临死的时候，他能够说：我的整个生命和全部精力，都献给了世界上最壮丽的事业———为解放全人类而奋斗。</p>
  </div>
  <hr>
</div>
</template>

<script>
export default {
  name: 'longyongyi',
  data () {
    return {
      name: 'hongkong',
      author1: '黄蚁',
      author2: '古龙',
      author3: '金蛹'
    }
  }
}
</script>
